/*
*************************************************************************************
**文件说明：任务
**文件名称：task.h 
**创建日期：2013.11.07  
**创 建 人：王玮
**-----------------------------------------------------------------------------------
**修改日期：2013.xx.xx
**修改说明：
*************************************************************************************
*/
#ifndef TASK_H
#define TASK_H
#include "user_cfg.h"

/***************************************************
任务堆栈大小
****************************************************/
#define START_STK_SIZE        (32)
#define RTC_STK_SIZE          (64)
#define LCD_STK_SIZE          (64)
#define GET_VOLT_STK_SIZE     (64)



/***************************************************
设置任务优先级
****************************************************/
#define START_TASK_PRIO        (5)
#define LCD_BRG_TASK_PRIO      (8)
#define NUM_DIS_TASK_PRIO      (9)
#define GET_VOLT_TASK_PRIO     (10)
#define RTC_TASK_PRIO          (11)








/***************************************************
任务堆栈
****************************************************/
extern OS_STK  TASK_START_STK[START_STK_SIZE];

extern void TaskStart(void *pdata);

#endif
